Autodesk.Revit.DB.EmbodiedCarbonCoefficientUnitType
Since:
2027
Represents the unit type of Embodied Carbon coefficient in a EmbodiedCarbon asset.
Since:
2027

Autodesk.Revit.DB.EmbodiedCarbonCoefficientUnitType.PerItem
Embodied Carbon Coefficient per item

Autodesk.Revit.DB.EmbodiedCarbonCoefficientUnitType.PerMass
Embodied Carbon Coefficient per Mass

Autodesk.Revit.DB.EmbodiedCarbonCoefficientUnitType.PerEnergy
Embodied Carbon Coefficient per energy

Autodesk.Revit.DB.EmbodiedCarbonCoefficientUnitType.PerVolume
Embodied Carbon Coefficient per volume

Autodesk.Revit.DB.EmbodiedCarbonCoefficientUnitType.PerArea
Embodied Carbon Coefficient per area

Autodesk.Revit.DB.EmbodiedCarbonCoefficientUnitType.PerLength
Embodied Carbon Coefficient per length

Autodesk.Revit.DB.EmbodiedCarbonCoefficientUnitType.Undefined
Embodied Carbon Coefficient unit is Undefined